--------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/johnmcdonnell/Desktop/Stata fellow training/Introduction and Basics.log
  log type:  text
 opened on:   7 Jul 2023, 17:25:33

. 
. 
. * Stata: Introduction and Basics
. * reference: Getting Started with Stata (Mac) - gsm.pdf
. 
. 
. * set working directory
. 
. cd "/Users/johnmcdonnell/Desktop/Stata fellow training"
/Users/johnmcdonnell/Desktop/Stata fellow training

. 
. * open a sample file
. 
. sysuse auto, clear
(1978 automobile data)

. 
. * examine the file, how is this dataset constructed?
. 
. describe

Contains data from /Applications/Stata/ado/base/a/auto.dta
 Observations:            74                  1978 automobile data
    Variables:            12                  13 Apr 2020 17:45
                                              (_dta has notes)
--------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------------------------------
make            str18   %-18s                 Make and model
price           int     %8.0gc                Price
mpg             int     %8.0g                 Mileage (mpg)
rep78           int     %8.0g                 Repair record 1978
headroom        float   %6.1f                 Headroom (in.)
trunk           int     %8.0g                 Trunk space (cu. ft.)
weight          int     %8.0gc                Weight (lbs.)
length          int     %8.0g                 Length (in.)
turn            int     %8.0g                 Turn circle (ft.)
displacement    int     %8.0g                 Displacement (cu. in.)
gear_ratio      float   %6.2f                 Gear ratio
foreign         byte    %8.0g      origin     Car origin
--------------------------------------------------------------------------------------------------------------------------
Sorted by: foreign

. 
. * looks like there is a note in there, what is this all about?
. 
. notes

_dta:
  1.  From Consumer Reports with permission

. 
. browse

. 
. summarize

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
        make |          0
       price |         74    6165.257    2949.496       3291      15906
         mpg |         74     21.2973    5.785503         12         41
       rep78 |         69    3.405797    .9899323          1          5
    headroom |         74    2.993243    .8459948        1.5          5
-------------+---------------------------------------------------------
       trunk |         74    13.75676    4.277404          5         23
      weight |         74    3019.459    777.1936       1760       4840
      length |         74    187.9324    22.26634        142        233
        turn |         74    39.64865    4.399354         31         51
displacement |         74    197.2973    91.83722         79        425
-------------+---------------------------------------------------------
  gear_ratio |         74    3.014865    .4562871       2.19       3.89
     foreign |         74    .2972973    .4601885          0          1

. 
. * what if you want to learn more about a particular variable?
. 
. codebook price

--------------------------------------------------------------------------------------------------------------------------
price                                                                                                                Price
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (int)

                 Range: [3291,15906]                  Units: 1
         Unique values: 74                        Missing .: 0/74

                  Mean: 6165.26
             Std. dev.:  2949.5

           Percentiles:     10%       25%       50%       75%       90%
                           3895      4195    5006.5      6342     11385

. 
. codebook make

--------------------------------------------------------------------------------------------------------------------------
make                                                                                                        Make and model
--------------------------------------------------------------------------------------------------------------------------

                  Type: String (str18), but longest is str17

         Unique values: 74                        Missing "": 0/74

              Examples: "Cad. Deville"
                        "Dodge Magnum"
                        "Merc. XR-7"
                        "Pont. Catalina"

               Warning: Variable has embedded blanks.

. 
. codebook rep78 /* what does this "." mean? */

--------------------------------------------------------------------------------------------------------------------------
rep78                                                                                                   Repair record 1978
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (int)

                 Range: [1,5]                         Units: 1
         Unique values: 5                         Missing .: 5/74

            Tabulation: Freq.  Value
                            2  1
                            8  2
                           30  3
                           18  4
                           11  5
                            5  .

. 
. * drilling down missing data
. 
. browse if missing(rep78)

. 
. list make if missing(rep78)

     +---------------+
     | make          |
     |---------------|
  3. | AMC Spirit    |
  7. | Buick Opel    |
 45. | Plym. Sapporo |
 51. | Pont. Phoenix |
 64. | Peugeot 604   |
     +---------------+

. 
. * lets look deeper at the "price" variable
. 
. summarize price, detail

                            Price
-------------------------------------------------------------
      Percentiles      Smallest
 1%         3291           3291
 5%         3748           3299
10%         3895           3667       Obs                  74
25%         4195           3748       Sum of wgt.          74

50%       5006.5                      Mean           6165.257
                        Largest       Std. dev.      2949.496
75%         6342          13466
90%        11385          13594       Variance        8699526
95%        13466          14500       Skewness       1.653434
99%        15906          15906       Kurtosis       4.819188

. 
. list if price > 13000

     +-----------------------------------------------------------------------------------------------------------+
 12. | make             |  price | mpg | rep78 | headroom | trunk | weight | length | turn | displa~t | gear_r~o |
     | Cad. Eldorado    | 14,500 |  14 |     2 |      3.5 |    16 |  3,900 |    204 |   43 |      350 |     2.19 |
     |-----------------------------------------------------------------------------------------------------------|
     |                                                  foreign                                                  |
     |                                                 Domestic                                                  |
     +-----------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------+
 13. | make             |  price | mpg | rep78 | headroom | trunk | weight | length | turn | displa~t | gear_r~o |
     | Cad. Seville     | 15,906 |  21 |     3 |      3.0 |    13 |  4,290 |    204 |   45 |      350 |     2.24 |
     |-----------------------------------------------------------------------------------------------------------|
     |                                                  foreign                                                  |
     |                                                 Domestic                                                  |
     +-----------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------+
 27. | make             |  price | mpg | rep78 | headroom | trunk | weight | length | turn | displa~t | gear_r~o |
     | Linc. Mark V     | 13,594 |  12 |     3 |      2.5 |    18 |  4,720 |    230 |   48 |      400 |     2.47 |
     |-----------------------------------------------------------------------------------------------------------|
     |                                                  foreign                                                  |
     |                                                 Domestic                                                  |
     +-----------------------------------------------------------------------------------------------------------+

     +-----------------------------------------------------------------------------------------------------------+
 28. | make             |  price | mpg | rep78 | headroom | trunk | weight | length | turn | displa~t | gear_r~o |
     | Linc. Versailles | 13,466 |  14 |     3 |      3.5 |    15 |  3,830 |    201 |   41 |      302 |     2.47 |
     |-----------------------------------------------------------------------------------------------------------|
     |                                                  foreign                                                  |
     |                                                 Domestic                                                  |
     +-----------------------------------------------------------------------------------------------------------+

. 
. * what about variables that are categorical - yes/no, foreign/domestic, etc
. 
. tabulate foreign

 Car origin |      Freq.     Percent        Cum.
------------+-----------------------------------
   Domestic |         52       70.27       70.27
    Foreign |         22       29.73      100.00
------------+-----------------------------------
      Total |         74      100.00

. 
. tabulate rep78 /* we don't really know, but we'll assume that 1 is a poor repair record and 5 is good */

     Repair |
record 1978 |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          2        2.90        2.90
          2 |          8       11.59       14.49
          3 |         30       43.48       57.97
          4 |         18       26.09       84.06
          5 |         11       15.94      100.00
------------+-----------------------------------
      Total |         69      100.00

. 
. * what about repair record for foreign versus domestic cars?
. 
. tabulate rep78 foreign

    Repair |
    record |      Car origin
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |         2          0 |         2 
         2 |         8          0 |         8 
         3 |        27          3 |        30 
         4 |         9          9 |        18 
         5 |         2          9 |        11 
-----------+----------------------+----------
     Total |        48         21 |        69 

. tabulate rep78 foreign, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

    Repair |
    record |      Car origin
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |         2          0 |         2 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         2 |         8          0 |         8 
           |    100.00       0.00 |    100.00 
-----------+----------------------+----------
         3 |        27          3 |        30 
           |     90.00      10.00 |    100.00 
-----------+----------------------+----------
         4 |         9          9 |        18 
           |     50.00      50.00 |    100.00 
-----------+----------------------+----------
         5 |         2          9 |        11 
           |     18.18      81.82 |    100.00 
-----------+----------------------+----------
     Total |        48         21 |        69 
           |     69.57      30.43 |    100.00 

. tabulate rep78 foreign, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Repair |
    record |      Car origin
      1978 |  Domestic    Foreign |     Total
-----------+----------------------+----------
         1 |         2          0 |         2 
           |      4.17       0.00 |      2.90 
-----------+----------------------+----------
         2 |         8          0 |         8 
           |     16.67       0.00 |     11.59 
-----------+----------------------+----------
         3 |        27          3 |        30 
           |     56.25      14.29 |     43.48 
-----------+----------------------+----------
         4 |         9          9 |        18 
           |     18.75      42.86 |     26.09 
-----------+----------------------+----------
         5 |         2          9 |        11 
           |      4.17      42.86 |     15.94 
-----------+----------------------+----------
     Total |        48         21 |        69 
           |    100.00     100.00 |    100.00 

. 
. * what if you want to examine a continuous variable by category?
. 
. by foreign, sort: summarize mpg

--------------------------------------------------------------------------------------------------------------------------
-> foreign = Domestic

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         mpg |         52    19.82692    4.743297         12         34

--------------------------------------------------------------------------------------------------------------------------
-> foreign = Foreign

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
         mpg |         22    24.77273    6.611187         14         41


. 
. * simple hypothesis testing
. 
. ttest mpg, by(foreign)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
Domestic |      52    19.82692     .657777    4.743297    18.50638    21.14747
 Foreign |      22    24.77273     1.40951    6.611187    21.84149    27.70396
---------+--------------------------------------------------------------------
Combined |      74     21.2973    .6725511    5.785503     19.9569    22.63769
---------+--------------------------------------------------------------------
    diff |           -4.945804    1.362162               -7.661225   -2.230384
------------------------------------------------------------------------------
    diff = mean(Domestic) - mean(Foreign)                         t =  -3.6308
H0: diff = 0                                     Degrees of freedom =       72

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0003         Pr(|T| > |t|) = 0.0005          Pr(T > t) = 0.9997

. 
. * what if we are not sure we want this type of t test?
. 
. help ttest

. 
. * descriptive statistics: correlation matrices
. 
. correlate mpg weight
(obs=74)

             |      mpg   weight
-------------+------------------
         mpg |   1.0000
      weight |  -0.8072   1.0000


. 
. by foreign, sort: correlate mpg weight

--------------------------------------------------------------------------------------------------------------------------
-> foreign = Domestic
(obs=52)

             |      mpg   weight
-------------+------------------
         mpg |   1.0000
      weight |  -0.8759   1.0000


--------------------------------------------------------------------------------------------------------------------------
-> foreign = Foreign
(obs=22)

             |      mpg   weight
-------------+------------------
         mpg |   1.0000
      weight |  -0.6829   1.0000



. 
. * simple graphics 
. 
. twoway (scatter mpg weight)

. 
. twoway (scatter mpg weight), by(foreign, total)

. 
. 
. * simple regression modelling
. 
. * from the graphs, we want to fit a regression model predicting MPG from the weight and type of car
. * we have reason to think that this may not be a linear relationship, and may be better to consider weight as a quadrati
> c
. 
. generate wtsq = weight ^ 2

. 
. list weight wtsq in 1/10

     +-------------------+
     | weight       wtsq |
     |-------------------|
  1. |  2,930    8584900 |
  2. |  3,350   1.12e+07 |
  3. |  2,640    6969600 |
  4. |  3,250   1.06e+07 |
  5. |  4,080   1.66e+07 |
     |-------------------|
  6. |  3,670   1.35e+07 |
  7. |  2,230    4972900 |
  8. |  3,280   1.08e+07 |
  9. |  3,880   1.51e+07 |
 10. |  3,400   1.16e+07 |
     +-------------------+

. 
. regress mpg weight wtsq foreign

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(3, 70)        =     52.25
       Model |  1689.15372         3   563.05124   Prob > F        =    0.0000
    Residual |   754.30574        70  10.7757963   R-squared       =    0.6913
-------------+----------------------------------   Adj R-squared   =    0.6781
       Total |  2443.45946        73  33.4720474   Root MSE        =    3.2827

------------------------------------------------------------------------------
         mpg | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      weight |  -.0165729   .0039692    -4.18   0.000    -.0244892   -.0086567
        wtsq |   1.59e-06   6.25e-07     2.55   0.013     3.45e-07    2.84e-06
     foreign |    -2.2035   1.059246    -2.08   0.041      -4.3161   -.0909002
       _cons |   56.53884   6.197383     9.12   0.000     44.17855    68.89913
------------------------------------------------------------------------------

. 
. * what if we want to plot the predicted values on top of the scatterplots for each of the origins of cars
. 
. predict mpghat
(option xb assumed; fitted values)

. 
. twoway (scatter mpg weight) (line mpghat weight, sort), by(foreign)

. 
. 
. generate gp100m = 100/mpg

. label variable gp100m "Gallons per 100 miles"

. twoway (scatter gp100m weight), by(foreign, total)

. 
. regress gp100m weight foreign

      Source |       SS           df       MS      Number of obs   =        74
-------------+----------------------------------   F(2, 71)        =    113.97
       Model |  91.1761694         2  45.5880847   Prob > F        =    0.0000
    Residual |  28.4000913        71  .400001287   R-squared       =    0.7625
-------------+----------------------------------   Adj R-squared   =    0.7558
       Total |  119.576261        73  1.63803097   Root MSE        =    .63246

------------------------------------------------------------------------------
      gp100m | Coefficient  Std. err.      t    P>|t|     [95% conf. interval]
-------------+----------------------------------------------------------------
      weight |   .0016254   .0001183    13.74   0.000     .0013896    .0018612
     foreign |   .6220535   .1997381     3.11   0.003     .2237871     1.02032
       _cons |  -.0734839   .4019932    -0.18   0.855    -.8750354    .7280677
------------------------------------------------------------------------------

. 
. ************************************************************************************************************************
> ********
. 
. use SarahsSTATAtest, clear
(SarahsSTATATest_DATA_NOHDRS_2023-07-07_1627.csv)

. 
. * overall description
. describe

Contains data from SarahsSTATAtest.dta
 Observations:           120                  SarahsSTATATest_DATA_NOHDRS_2023-07-07_1627.csv
    Variables:            18                  7 Jul 2023 16:34
--------------------------------------------------------------------------------------------------------------------------
Variable      Storage   Display    Value
    name         type    format    label      Variable label
--------------------------------------------------------------------------------------------------------------------------
record_id       int     %8.0g                 Record ID
mrn             long    %12.0g                MRN
gender          byte    %8.0g      gender_    Gender
age_years       byte    %8.0g                 Age (years)
overweight      byte    %8.0g      overweight_
                                              Overweight
age_gt_12       byte    %8.0g      age_gt_12_
                                              Age > 12 years
hemoglobin_a1c  float   %9.0g                 Hemoglobin A1c
non_hdl_chole~l int     %8.0g                 Non HDL cholesterol
bp_ord          byte    %20.0g     bp_ord_    Blood pressure levels
ahtn_med        byte    %8.0g      ahtn_med_
                                              Antihypertensive medication use
med___1         byte    %9.0g      med___1_   Antihypertensive medication (choice=ACEi)
med___2         byte    %9.0g      med___2_   Antihypertensive medication (choice=Angiotensin receptor blocker)
med___3         byte    %9.0g      med___3_   Antihypertensive medication (choice=Calcium channel blocker)
med___4         byte    %9.0g      med___4_   Antihypertensive medication (choice=Beta blocker)
med___5         byte    %9.0g      med___5_   Antihypertensive medication (choice=Alpha blocker)
med___9         byte    %9.0g      med___9_   Antihypertensive medication (choice=Others)
htn_relative    byte    %58.0g     htn_relative_
                                              Relatives with hypertension
my_first_inst~e byte    %10.0g     my_first_instrument_complete_
                                              Complete?
--------------------------------------------------------------------------------------------------------------------------
Sorted by: 

. 
. * look at continuous variables. notice how the command doesn't really know how to deal with character variables
. summarize 

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   record_id |        120        60.5    34.78505          1        120
         mrn |        120       74657    42924.76       1234     148080
      gender |        120        .475    .5014684          0          1
   age_years |        120    11.03333    3.297397          6         17
  overweight |        120    .1916667    .3952626          0          1
-------------+---------------------------------------------------------
   age_gt_12 |        120        .375    .4861528          0          1
hemoglobi~1c |        120    8.760833    2.096347        3.3       14.7
non_hdl_ch~l |        120    99.36667    42.28215          6        215
      bp_ord |          0
    ahtn_med |          0
-------------+---------------------------------------------------------
     med___1 |        120           0           0          0          0
     med___2 |        120           0           0          0          0
     med___3 |        120           0           0          0          0
     med___4 |        120           0           0          0          0
     med___5 |        120           0           0          0          0
-------------+---------------------------------------------------------
     med___9 |        120           0           0          0          0
htn_relative |          0
my_first_i~e |        120           0           0          0          0

. 
. * so, what do these character variables really look like?
. browse

. 
. codebook

--------------------------------------------------------------------------------------------------------------------------
record_id                                                                                                        Record ID
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (int)

                 Range: [1,120]                       Units: 1
         Unique values: 120                       Missing .: 0/120

                  Mean:    60.5
             Std. dev.: 34.7851

           Percentiles:     10%       25%       50%       75%       90%
                           12.5      30.5      60.5      90.5     108.5

--------------------------------------------------------------------------------------------------------------------------
mrn                                                                                                                    MRN
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (long)

                 Range: [1234,148080]                 Units: 1
         Unique values: 120                       Missing .: 0/120

                  Mean:   74657
             Std. dev.: 42924.8

           Percentiles:     10%       25%       50%       75%       90%
                          15425     37637     74657    111677    133889

--------------------------------------------------------------------------------------------------------------------------
gender                                                                                                              Gender
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: gender_

                 Range: [0,1]                         Units: 1
         Unique values: 2                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                           63         0  Male
                           57         1  Female

--------------------------------------------------------------------------------------------------------------------------
age_years                                                                                                      Age (years)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)

                 Range: [6,17]                        Units: 1
         Unique values: 12                        Missing .: 0/120

                  Mean: 11.0333
             Std. dev.:  3.2974

           Percentiles:     10%       25%       50%       75%       90%
                              6         8        11        14        16

--------------------------------------------------------------------------------------------------------------------------
overweight                                                                                                      Overweight
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: overweight_

                 Range: [0,1]                         Units: 1
         Unique values: 2                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                           97         0  No
                           23         1  Yes

--------------------------------------------------------------------------------------------------------------------------
age_gt_12                                                                                                   Age > 12 years
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: age_gt_12_

                 Range: [0,1]                         Units: 1
         Unique values: 2                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                           75         0  No
                           45         1  Yes

--------------------------------------------------------------------------------------------------------------------------
hemoglobin_a1c                                                                                              Hemoglobin A1c
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (float)

                 Range: [3.3,14.7]                    Units: .1
         Unique values: 64                        Missing .: 0/120

                  Mean: 8.76083
             Std. dev.: 2.09635

           Percentiles:     10%       25%       50%       75%       90%
                            6.1       7.7       8.5       9.9      11.7

--------------------------------------------------------------------------------------------------------------------------
non_hdl_cholesterol                                                                                   Non HDL cholesterol 
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (int)

                 Range: [6,215]                       Units: 1
         Unique values: 82                        Missing .: 0/120

                  Mean: 99.3667
             Std. dev.: 42.2822

           Percentiles:     10%       25%       50%       75%       90%
                             41      70.5     105.5       131       149

--------------------------------------------------------------------------------------------------------------------------
bp_ord                                                                                               Blood pressure levels
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: bp_ord_

                 Range: [.,.]                         Units: .
         Unique values: 0                         Missing .: 120/120

            Tabulation: Freq.   Numeric  Label
                          120         .  

--------------------------------------------------------------------------------------------------------------------------
ahtn_med                                                                                   Antihypertensive medication use
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: ahtn_med_

                 Range: [.,.]                         Units: .
         Unique values: 0                         Missing .: 120/120

            Tabulation: Freq.   Numeric  Label
                          120         .  

--------------------------------------------------------------------------------------------------------------------------
med___1                                                                          Antihypertensive medication (choice=ACEi)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: med___1_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Unchecked

--------------------------------------------------------------------------------------------------------------------------
med___2                                                  Antihypertensive medication (choice=Angiotensin receptor blocker)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: med___2_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Unchecked

--------------------------------------------------------------------------------------------------------------------------
med___3                                                       Antihypertensive medication (choice=Calcium channel blocker)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: med___3_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Unchecked

--------------------------------------------------------------------------------------------------------------------------
med___4                                                                  Antihypertensive medication (choice=Beta blocker)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: med___4_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Unchecked

--------------------------------------------------------------------------------------------------------------------------
med___5                                                                 Antihypertensive medication (choice=Alpha blocker)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: med___5_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Unchecked

--------------------------------------------------------------------------------------------------------------------------
med___9                                                                        Antihypertensive medication (choice=Others)
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: med___9_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Unchecked

--------------------------------------------------------------------------------------------------------------------------
htn_relative                                                                                   Relatives with hypertension
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: htn_relative_

                 Range: [.,.]                         Units: .
         Unique values: 0                         Missing .: 120/120

            Tabulation: Freq.   Numeric  Label
                          120         .  

--------------------------------------------------------------------------------------------------------------------------
my_first_instrument_complete                                                                                     Complete?
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: my_first_instrument_complete_

                 Range: [0,0]                         Units: 1
         Unique values: 1                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                          120         0  Incomplete

. * what are potential problems with how this is set up?
. 
. 
.         * PROBLEM 1: record_id is a numeric
. 
. summarize record_id, detail /* note that Stata is smart but not smart enough to save us from ourselves. If we want to do
>  something stupid and meaningless like calculate percentiles for the record_id variable, it is only to happy to comply *
> /

                          Record ID
-------------------------------------------------------------
      Percentiles      Smallest
 1%            2              1
 5%          6.5              2
10%         12.5              3       Obs                 120
25%         30.5              4       Sum of wgt.         120

50%         60.5                      Mean               60.5
                        Largest       Std. dev.      34.78505
75%         90.5            117
90%        108.5            118       Variance           1210
95%        114.5            119       Skewness              0
99%          119            120       Kurtosis       1.799833

. 
.         * PROBLEM 2: mrn is a numeric. this is the same issue as record_id
. 
.         * PROBLEM 3: variables med___1 med___2 med___3 med___4 med___5 med___9. These variable names are uninformative (
> although the variable labels help us a little). 
.         * Additionally, the value labels are a bit unhelpful as well. Who wants to see "Checked" and "Unchecked"?
.         
. * ALL of these problems have fairly easy solutions that we will come back to at a later class. For now, let's look into 
> the data a bit more
. 
. summarize age_years

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   age_years |        120    11.03333    3.297397          6         17

. summarize age_years, detail

                         Age (years)
-------------------------------------------------------------
      Percentiles      Smallest
 1%            6              6
 5%            6              6
10%            6              6       Obs                 120
25%            8              6       Sum of wgt.         120

50%           11                      Mean           11.03333
                        Largest       Std. dev.      3.297397
75%           14             17
90%           16             17       Variance       10.87283
95%         16.5             17       Skewness       .0820531
99%           17             17       Kurtosis       1.897739

. 
. by gender, sort: summarize age_years

--------------------------------------------------------------------------------------------------------------------------
-> gender = Male

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   age_years |         63     10.5873    3.255937          6         17

--------------------------------------------------------------------------------------------------------------------------
-> gender = Female

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
   age_years |         57    11.52632    3.301002          6         17


. 
. histogram age_years, by(gender)

. 
. tabulate overweight gender, row

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

           |        Gender
Overweight |      Male     Female |     Total
-----------+----------------------+----------
        No |        51         46 |        97 
           |     52.58      47.42 |    100.00 
-----------+----------------------+----------
       Yes |        12         11 |        23 
           |     52.17      47.83 |    100.00 
-----------+----------------------+----------
     Total |        63         57 |       120 
           |     52.50      47.50 |    100.00 

. tabulate overweight gender, col

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |        Gender
Overweight |      Male     Female |     Total
-----------+----------------------+----------
        No |        51         46 |        97 
           |     80.95      80.70 |     80.83 
-----------+----------------------+----------
       Yes |        12         11 |        23 
           |     19.05      19.30 |     19.17 
-----------+----------------------+----------
     Total |        63         57 |       120 
           |    100.00     100.00 |    100.00 

. 
. * whats with this age > 12 variable? Is it correct?
. list age_years age_gt_12

     +---------------------+
     | age_ye~s   age_g~12 |
     |---------------------|
  1. |        6         No |
  2. |       11         No |
  3. |       10         No |
  4. |       16        Yes |
  5. |       13        Yes |
     |---------------------|
  6. |       13        Yes |
  7. |        6         No |
  8. |       11         No |
  9. |        8         No |
 10. |        9         No |
     |---------------------|
 11. |       13        Yes |
 12. |       13        Yes |
 13. |        8         No |
 14. |        6         No |
 15. |        7         No |
     |---------------------|
 16. |        6         No |
 17. |        6         No |
 18. |       14        Yes |
 19. |        6         No |
 20. |       16        Yes |
     |---------------------|
 21. |        9         No |
 22. |       12         No |
 23. |       14        Yes |
 24. |       12         No |
 25. |       12         No |
     |---------------------|
 26. |       11         No |
 27. |       17        Yes |
 28. |       12         No |
 29. |       13        Yes |
 30. |        8         No |
     |---------------------|
 31. |       10         No |
 32. |       12         No |
 33. |       12         No |
 34. |        6         No |
 35. |       10         No |
     |---------------------|
 36. |        9         No |
 37. |        9         No |
 38. |       13        Yes |
 39. |        8         No |
 40. |       15        Yes |
     |---------------------|
 41. |       10         No |
 42. |        7         No |
 43. |       14        Yes |
 44. |        9         No |
 45. |       13        Yes |
     |---------------------|
 46. |       16        Yes |
 47. |        8         No |
 48. |       13        Yes |
 49. |       14        Yes |
 50. |       11         No |
     |---------------------|
 51. |        7         No |
 52. |       14        Yes |
 53. |       17        Yes |
 54. |       14        Yes |
 55. |        8         No |
     |---------------------|
 56. |        8         No |
 57. |       12         No |
 58. |        6         No |
 59. |       15        Yes |
 60. |        7         No |
     |---------------------|
 61. |        6         No |
 62. |        9         No |
 63. |        7         No |
 64. |       11         No |
 65. |       17        Yes |
     |---------------------|
 66. |       10         No |
 67. |       11         No |
 68. |       13        Yes |
 69. |       12         No |
 70. |       13        Yes |
     |---------------------|
 71. |       10         No |
 72. |        8         No |
 73. |        6         No |
 74. |       10         No |
 75. |       16        Yes |
     |---------------------|
 76. |       10         No |
 77. |        8         No |
 78. |        9         No |
 79. |       14        Yes |
 80. |       16        Yes |
     |---------------------|
 81. |       10         No |
 82. |        6         No |
 83. |        8         No |
 84. |       14        Yes |
 85. |       11         No |
     |---------------------|
 86. |       13        Yes |
 87. |       16        Yes |
 88. |       15        Yes |
 89. |       11         No |
 90. |       15        Yes |
     |---------------------|
 91. |        8         No |
 92. |        7         No |
 93. |        6         No |
 94. |        7         No |
 95. |       13        Yes |
     |---------------------|
 96. |       12         No |
 97. |       10         No |
 98. |       15        Yes |
 99. |       16        Yes |
100. |       11         No |
     |---------------------|
101. |        8         No |
102. |        8         No |
103. |        9         No |
104. |       14        Yes |
105. |       14        Yes |
     |---------------------|
106. |       13        Yes |
107. |        9         No |
108. |       17        Yes |
109. |       11         No |
110. |       17        Yes |
     |---------------------|
111. |       15        Yes |
112. |       14        Yes |
113. |       10         No |
114. |       15        Yes |
115. |       17        Yes |
     |---------------------|
116. |       14        Yes |
117. |       12         No |
118. |        9         No |
119. |        6         No |
120. |        7         No |
     +---------------------+

. 
end of do-file

. do "/var/folders/qp/44xx9pgd1_7c2_fs4jl3hf4h0000gn/T//SD54843.000000"

. count if age_years <= 12 & age_gt_12 == "yes" /* our first error message, what happened? note that following the r(109) 
> code gives us a clue*/
type mismatch
r(109);

end of do-file

r(109);

. do "/var/folders/qp/44xx9pgd1_7c2_fs4jl3hf4h0000gn/T//SD54843.000000"

. * note: some of Stata's most persnickety behavior comes from this issue, so it is worth getting into it further . . . 
. 
. codebook age_gt_12 /* the issue is that Stata really wants us to realize that this variable is really a 0/1 binary. It j
> ust happens to have a label corresponding to "yes" and "no". Stata takes the == VERY literally in this case */

--------------------------------------------------------------------------------------------------------------------------
age_gt_12                                                                                                   Age > 12 years
--------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric (byte)
                 Label: age_gt_12_

                 Range: [0,1]                         Units: 1
         Unique values: 2                         Missing .: 0/120

            Tabulation: Freq.   Numeric  Label
                           75         0  No
                           45         1  Yes

. 
. tabulate age_gt_12

   Age > 12 |
      years |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |         75       62.50       62.50
        Yes |         45       37.50      100.00
------------+-----------------------------------
      Total |        120      100.00

. tabulate age_gt_12, nolabel

   Age > 12 |
      years |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       62.50       62.50
          1 |         45       37.50      100.00
------------+-----------------------------------
      Total |        120      100.00

. 
. count if age_years <= 12 & age_gt_12 == 1 
  0

. count if age_years > 12 & age_gt_12 == 0 
  0

. 
. by overweight,sort: summarize hemoglobin_a1c /* this doesn't seem right, does it? */

--------------------------------------------------------------------------------------------------------------------------
-> overweight = No

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hemoglobi~1c |         97    8.810309    2.212864        3.3       14.7

--------------------------------------------------------------------------------------------------------------------------
-> overweight = Yes

    Variable |        Obs        Mean    Std. dev.       Min        Max
-------------+---------------------------------------------------------
hemoglobi~1c |         23    8.552174    1.532042        5.6       11.4


. 
. ttest hemoglobin_a1c, by(overweight)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. err.   Std. dev.   [95% conf. interval]
---------+--------------------------------------------------------------------
      No |      97    8.810309    .2246823    2.212864    8.364318      9.2563
     Yes |      23    8.552174    .3194529    1.532042    7.889669    9.214679
---------+--------------------------------------------------------------------
Combined |     120    8.760833    .1913694    2.096347    8.381903    9.139764
---------+--------------------------------------------------------------------
    diff |            .2581353    .4876649                -.707574    1.223845
------------------------------------------------------------------------------
    diff = mean(No) - mean(Yes)                                   t =   0.5293
H0: diff = 0                                     Degrees of freedom =      118

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.7012         Pr(|T| > |t|) = 0.5976          Pr(T > t) = 0.2988

. 
. capture log close
